--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
----------------------- CARACTERES LITERAIS ------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
-- UM LITERAL É UM CARACTERE, NÚMERO OU DATA INCLUIDO NUMA INSTRUÇÃO SQL. PARA
-- ISSO ELES PRECISAM ESTAR DELIMITADOS ENTRE ASPAS SIMPLES:
SELECT 'TEXTO DENTRO DA CONSULTA',
       'ESSA CONSULTA RETORNARÁ ' || 1 ||  ' LINHA',
       'DATA DE EXECUÇÃO ' || TO_DATE('22/03/2023', 'DD/MM/YYYY')
  FROM DUAL;